addons/binding/org.openhab.binding.ihc.test/src/test/resources/GetSettingsResponse.xml

<?xml version='1.0' encoding='UTF-8'?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
<SOAP-ENV:Body>
<ns1:getSettings1 xmlns:ns1="utcs" xsi:type="ns1:WSTimeManagerSettings">
<ns1:synchroniseTimeAgainstServer xsi:type="xsd:boolean">true</ns1:synchroniseTimeAgainstServer>

<ns1:useDST xsi:type="xsd:boolean">true</ns1:useDST>

<ns1:gmtOffsetInHours xsi:type="xsd:int">2</ns1:gmtOffsetInHours>

<ns1:serverName xsi:type="xsd:string">192.168.1.10</ns1:serverName>

<ns1:syncIntervalInHours xsi:type="xsd:int">24</ns1:syncIntervalInHours>

<ns1:timeAndDateInUTC xsi:type="ns1:WSDate">
<ns1:day xsi:type="xsd:int">7</ns1:day>

<ns1:monthWithJanuaryAsOne xsi:type="xsd:int">12</ns1:monthWithJanuaryAsOne>

<ns1:hours xsi:type="xsd:int">8</ns1:hours>

<ns1:minutes xsi:type="xsd:int">20</ns1:minutes>

<ns1:seconds xsi:type="xsd:int">10</ns1:seconds>

<ns1:year xsi:type="xsd:int">2018</ns1:year>
</ns1:timeAndDateInUTC>
</ns1:getSettings1>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>